{
    "essential": "Qalcyo will not provide support for the [Essential mod](https://essential.gg/), nor can we modify any part of it. please join [their Discord server](https://discord.gg/XUWCCqRf6H) for further information.",
    "skyblockextras": "SkyBlockExtras is notorious for all of it's bad nature and practices. The developers steal code from other popular mods, obfuscate the mod to try and hide their stolen code and break Mojang's EULA by selling the mod. Qalcyo support staff WILL NOT provide support while you use SBE, and other Discord servers most likely won't either.",
    "labymod": "LabyMod is known to cause many incompatibilities with other mods when used with Forge, this is common knowledge among the Minecraft modding community at this point. A rumour is being spread about it increasing FPS, which is somewhat true. This \"boost\" is just OptiFine which LabyMod installs along with itself and a few other optimizations that most likely don't affect much. Please don't use LabyMod if you'd like to use Qalcyo mods as 5/10 times the Qalcyo mod will have multiple issues due to LabyMod.",
    "requisite": {
        "about": "Requisite is a Minecraft utility library made to better the game's modding experience. To do this, it adds many new APIs and utilities for developers to use when creating mods. Requisite is available for all major Minecraft versions such as 1.8.9, 1.12.2 and 1.17.1.",
        "cosmetics": "Requisite uses cosmetics as a way to fund future development. The Qalcyo developers spend countless hours working on the mods you use and Requisite itself mostly without any form of compensation for this. It's obviously encouraged to purchase cosmetics to help fund firther development",
        "notifications": "You may have noticed compact and animated notifications appearing in the top right of your screen while playing, these are most likely added by Requisite. These notifications are one of the many APIs Requisite adds for mod developers to utilize for making your Minecraft experience better.",
        "keybinds": "Ever clicked a random key on your keyboard and it did something that isn't in the Minecraft keybindings menu? That might be a Requisite keybind!\n\nThe custom Requisite keybinds are yet another API added to make mod developers' lives easier and make your Minecraft experience just that little bit more enjoyable.\n\nTo access the Requisite keybinds menu, try running the /requisite command in-game.",
        "uninstall": "Unfortunately it isn't possible to uninstall Requisite without uninstalling the mods that use it. This is because of the limitations of Java.\n\nTo summarize it, Java uses a concept called object-oriented programming which has a 'class'-based system. Classes are essentially a file holding code, and uninstalling Requisite would mean removing those classes. Mods need those classes to work, or else your game would crash without a fix."
    }
}
